content/posts/the_curse_of_xanadu.md
+++
title = "The Curse of Xanadu"
author = ["Daniel Biasiotto"]
date = 2021-12-24T15:13:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://www.wired.com/1995/06/xanadu/>
-   Author: [Gary Wolf]({{< relref "gary_wolf.md" >}})
-   Related: [Wired]({{< relref "wired.md" >}}), [Xanadu]({{< relref "20211218212946-xanadu.md" >}}), [Project Xanadu]({{< relref "20211218213307-project_xanadu.md" >}})

> It was the most radical computer dream of the hacker era. Ted Nelson's Xanadu project was supposed to be the universal, democratic hypertext library that would help human life evolve into an entirely new form.


## Notes {#notes}

-   [Ted Nelson]({{< relref "20211218213319-ted_nelson.md" >}}) "king of unsuccessful software development"
-   the goal of the project was to put all information within reach of all
    -   eliminate scientific ignorance
    -   create a formu for discussion and debate
-   Ted suffers from [ADHD]({{< relref "attention_deficit_disorder.md" >}})[^fn:1]

[^fn:1]: All the recording, audio or otherwise, Nelson does is for combat the fleetability of his thoughts